Repository: mlforcada/llibre-tecnol-trad
Catalog: llibrett/omegat/tm/memtrad-tecnicasTA-usosTA.tmx
Source language: ca
Languages: es_es

source: Tots aquests models (i els anteriors) es combinen per a obtenir una puntuació global per a cada hipòtesi de traducció i poder escollir així la millor.
es_es: Todos estos modelos (y los anteriores) se combinan para obtener una puntuación global para cada hipótesis de traducción y poder escoger así la mejor.

source: Traducció automàtica
es_es: Traducción automática

source: Traducció directa i traducció indirecta
es_es: Traducción directa y traducción indirecta

source: Traducció indirecta per transferència
es_es: Traducción indirecta por transferencia

source: Traducció semiautomàtica
es_es: Traducción semiautomática

source: Traduir una oració, en aquest esquema, comporta: fer-ne l'anàlisi sintàctica completa, assignar interpretació a cada mot, construir composicionalment una interpretació de l'oració, analitzar-la per a obtenir mots i un arbre d'anàlisi sintàctica per a la llengua meta (LM), i generar una oració en LM a partir dels mots i l'arbre.
es_es: Traducir una oración, en este esquema, conlleva: hacer el análisis sintáctico completo, asignar interpretación a cada palabra, construir composicionalmente una interpretación de la oración, analizarla para obtener palabras y un árbol de análisis sintáctico para la lengua meta (LM), y generar una oración en LM a partir de las palabras y el árbol.

source: Trieu dues llengües $A$ i $B$ i indiqueu quins canvis són previsibles, classificant-los segons la naturalesa lingüística dels fenòmens que han causat els canvis, explicant la raó del resultat si cal amb un exemple.
es_es: Elegid dos lenguas $A$ y $B$ e indicad qué cambios son previsibles, clasificándolos según la naturaleza lingüística de los fenomens que han causado los cambios, explicando la razón del resultado si hace falta con un ejemplo.

source: Típicament, el mot més freqüent pot arribar a constituir el 10% de tot el text, però el segon només cobreix al voltant del 5%, el tercer al voltant del 3%, etc.; quan arribem al 100é mot més freqüent ja hem de parlar del 0,1% (una vegada cada 1.000 mots), i si arribem a la posició 1000, del 0,01% (una vegada cada 10.000 mots).
es_es: Típicamente, la palabra más frecuente puede llegar a constituir el 10% de todo el texto, pero el segundo sólo cubre alrededor del 5%, el tercero alrededor del 3%, etc.; cuando llegamos a la 100é palabra más frecuente ya tenemos que hablar del 0,1% (una vez cada 1.000 palabras), y si llegamos a la posición 1000, del 0,01% (una vez cada 10.000 palabras).

source: URI: {http://www.interlingua.com
es_es: La URI es {http://www.intelingua.com

source: Un llenguatge controlat és ``un subconjunt del llenguatge natural definit amb precisió, d'una banda restringit quant al lèxic, a la gramàtica i a l'estil, i d'una altra, possiblement estés amb terminologia i construccions gramaticals específiques d'un domini'' {huijsen98u}.
es_es: Un lenguaje controlado es ``un subconjunto del lenguaje natural definido con precisión, por un lado restringido en cuanto al léxico, a la gramática y al estilo, y de otro, posiblemente extendido con terminología y construcciones gramaticales específicas de un dominio'' {huijsen98uno}.

source: Un model de llengua es un model probabilístic que serveix per a mesurar la versemblança d'una oració o text en LM; es a dir, la seua fluïdesa o gramaticalitat. Aquests models s'aprenen de forma automàtica a partir d'un corpus de text en LM i es basen en comptar la freqüència de segments de longitud fixa, normalment segments de fins a cinc paraules, per evitar assignar una versemblança nul·la a oracions que, tot i que són correctes, no apareixen en els corpus d'entrenament. El model de llengua té en compte l'ordre de les paraules i per tant assigna una versemblança major a l'oració M'agrada menjar pernil del bo que a l'oració del bo menjar pernil M'agrada, tot i que contenen els mateixos segments de text (del bo, menjar pernil i M'agrada).
es_es: Un modelo de lengua es un modelo probabilístico que sirve para medir la verosimilitud de una oración o texto en LM; es decir, su fluidez o gramaticalidad. Estos modelos se aprenden de forma automática a partir de un corpus de texto en LM y se basan en contar la frecuencia de segmentos de longitud fija, normalmente segmentos de hasta cinco palabras, para evitar asignar una verosimilitud nula a oraciones que, a pesar de que son correctas, no aparecen en los corpus de entrenamiento. El modelo de lengua tiene en cuenta el orden de las palabras y, por lo tanto, asigna una verosimilitud mayor a la oración M'agrada menjar pernil del bo que a la oración del bo menjar pernil M'agrada, a pesar de que contienen los mismos segmentos de texto (del bo, menjar pernil y M'agrada).

source: Un graf dirigit té dues parts: un conjunt de nodes, nusos o vèrtexs (representats gràficament com a punts o cercles) i un conjunt de fletxes cada una de les quals va d'un vèrtex a altre.
es_es: Un grafo dirigido tiene dos partes: un conjunto de nodos, nudos o vértices (representados gráficamente como puntos o círculos) y un conjunto de flechas, cada una de las cuales, va de un vértice a otro.

source: Un sistema de traducció automàtica indirecta per transferència, o, abreviadament, sistema de transferència és el que fa les traduccions en tres fases ben diferenciades anomenades anàlisi, transferència i generació; cada una d'aquestes fases és realitzada per un mòdul (un subprograma) del sistema: El mòdul d'anàlisi és un mòdul monolingüe que produeix, a partir de la frase en LO, una representació abstracta del text origen (RATO).
es_es: Un sistema de traducción automática indirecta por transferencia, o, abreviadamente, sistema de transferencia es el que hace las traducciones en tres fases muy diferenciadas llamadas análisis, transferencia y generación; cada una de estas fases es realizada por un módulo (un subprograma) del sistema: El módulo deanálisis es un módulo monolingüe que produce, a partir de la frase en LO, una representación abstracta del texto origen (RATO).

source: Un aclariment és necessari sobre el tractament dels textos informatitzats.
es_es: Es necesario hacer una aclaración sobre el tratamiento de los textos informatizados.

source: Un amic meu ha dissenyat un sistema de traducció automàtica entre l'espanyol i el portugués, però tot i que m'assegura que no ha programat cap tractament de l'ambigüitat estructural, el seu sistema tradueix perfectament un munt d'oracions amb aquest tipus d'ambigüitat.
es_es: Un amigo mío ha diseñado un sistema de traducción automática entre el español y el portugués, pero a pesar de que me asegura que no ha programado ningún tratamiento de la ambigüedad estructural, su sistema traduce perfectamente un montón de oraciones con este tipo de ambigüedad.

source: Un analitzador morfològic, per tant, ha de tenir la informació següent sobre la llengua dels textos que s'han d'analitzar: el vocabulari o conjunt de lemes, els paradigmes de flexió, i la correspondència entre lemes i paradigmes.
es_es: Un analizador morfológico, por tanto, tiene que tener la información siguiente sobre la lengua de los textos que se tienen que analizar: el vocabulario o conjunto de lemas, los paradigmas de flexión, y la correspondencia entre lemas y paradigmas.

source: Un decenni després, i com que les expectatives eren tan altes, els avanços eren escassos i el futur pròxim no semblava poder millorar la situació.
es_es: Un decenio después, y como las expectativas eran tan altas, los avances eran escasos y el futuro próximo no parecía poder mejorar la situación.

source: Un dels avantatges més importants dels sistemes d'interlingua respecte dels sistemes de transferència és la facilitat amb què es pot afegir una llengua nova a un sistema de traducció automàtica multilingüe.
es_es: Una de las ventajas más importantes de todos los sistemas de interlingua respecto a los sistemas de transferencia es la facilidad con la que se puede añadir una lengua nueva a un sistema de traducción automática multilingüe.

source: Un dels principis de PACE és ``un mot, un significat'', és a dir, s'hi estableixen restriccions lèxiques clares a través d'un diccionari, cosa que simplifica el disseny dels diccionaris del sistema de traducció automàtica.
es_es: Uno de los principios de PACE es ``una palabra, un significado", es decir, se establecen restricciones léxicas claras a través de un diccionario, cosa que simplifica el diseño de los diccionarios del sistema de traducción automática.

source: Un estudi de bigrames (parelles) com aquests pot servir:
es_es: Un estudio de bigramas (parejas) como estos puede servir:

source: Un exemple clàssic d'això el donen les oracions adjectives de relatiu; la sèrie de sintagmes nominals ``el cotxe'', ``el cotxe que va dur l'home'', ``el cotxe que va dur l'home que va vindre del poble'', ``el cotxe que va dur l'home que va vindre del poble que vam visitar durant el viatge'', etc., demostra que no hi ha límits a la longitud d'un sintagma (nominal, en aquest cas).
es_es: Un ejemplo clásico de esto está en las oraciones adjetivas de relativo; la serie de sintagmas nominales ``el cotxe", "el cotxe que va dur l'home", ``el cotxe que va dur l'home que va vindre del poble", ``el cotxe que va dur l'home que va vindre del poble que vam visitar durant el viatje", etc., demuestra que no hay límites en la longitud de un sintagma (nominal, en este caso).

source: Un exemple històric de llenguatge controlat que va ser usat per a millorar els resultats de la traducció automàtica ---en concret, els obtinguts amb un sistema també històric anomenat Weidner MicroCat--- és PACE (Perkins Approved Clear English), el llenguatge controlat usat durant els anys vuitanta i part dels noranta per l'empresa d'enginyeria Perkins Engines per a facilitar la traducció automàtica dels manuals que descriuen les característiques i el manteniment d'aquests motors {newton92b,douglas96p}.
es_es: Un ejemplo histórico de lenguaje controlado que será utilizado para mejorar los resultados de la traducción automática ---concretamente, los obtenidos con un sistema también histórico llamado Weidner MicroCat--- es PACE (Perkins Approved Clear English), el lenguaje controlado usado durante los años ochenta y parte de los noventa por la empresa de ingeniería Perkins Engines para facilitar la traducción automática de los manuales que describen las características y el mantenimiento de estos motores {newton92b,douglas96p}.

source: Un exemple n'és Méteo, el sistema que des del 1982 fins al 2001 produïa informes meteorològics simultanis en francés i en anglés al Canadà.
es_es: Un ejemplo es Méteo, el sistema que desde 1982 hasta 2001 producía informes meteorológicos simultáneos en francés y en inglés en Canadá.

source: Un exemple servirà per a il·lustrar tots aquests conceptes. Imaginem la següent gramàtica simplificada que accepta un bon nombre d'oracions simples en català: $$ {rcl} {O} {SN} {SV}
es_es: Un ejemplo servirá para ilustrar todos estos conceptos. Imaginemos la siguiente gramática simplificada que acepta un buen número de oraciones simples en catalán: $$ {rcl} {O} {SN} {SV}

source: Un llenguatge controlat té sovint associat un conjunt de programes de suport que ajuden a avaluar i escriure documents que en complisquen les restriccions.
es_es: Un lenguaje controlado a menudo tiene asociado un conjunto de programas de apoyo que ayudan a evaluar y a escribir documentos que cumplan las restricciones.

source: Un sistema complet de transferència que traduïra entre aquestes tres llengües en els dos sentits tindria tres mòduls d'anàlisi (que anomenarem $A_1$, $A_2$ i $A_3$), tres mòduls de generació (que anomenarem $G_1$, $G_2$ i $G_3$) i sis mòduls de transferència (que anomenarem $T_{12}$, $T_{13}$, $T_{23}$, $T_{31}$, $T_{32}$ i $T_{21}$). Afegir un quart idioma $L_4$ al sistema comporta: Crear un nou mòdul d'anàlisi ($A_4$).
es_es: Un sistema completo de transferencia que tradujera entre estas tres lenguas en los dos sentidos tendría tres módulos de análisis (que denominaremos $A_1$, $A_2$ y $A_3$), tres módulos de generación (que denominaremos $G_1$, $G_2$ y $G_3$) y seis módulos de transferencia (que denominaremos $T_{12}$, $T_{13}$, $T_{23}$, $T_{31}$, $T_{32}$ y $T_{21}$). Añadir un cuarto idioma $L_4$ al sistema conlleva: Crear un nuevo módulo de análisis ($A_4$).

source: Un sistema de traducció automàtica hipotètic del rus al català produeix text que és bàsicament correcte excepte pel fet que no genera ni articles determinats (el, la, l', els, les) ni indeterminats (un, una, uns, unes).
es_es: Un sistema de traducción automática hipotético del ruso al catalán produce texto que es básicamente correcto excepto por el hecho de que no genera ni artículos determinados (el, la, l', els, les) ni indeterminados (un, una, uns, unes).

source: Un sistema de traducció automàtica per transferència tradueix en qualsevol sentit entre quatre llengües.
es_es: Un sistema de traducción automática por transferencia traduce en cualquier sentido entre cuatro lenguas.

source: Un sistema que suggereix millores a l'estil d'un document es pot considerar com {} {} HAMT.
es_es: Un sistema que sugiere mejoras en el estilo de un documento se puede considerar como {} {} HAMT.

source: Un sistema real de transferència sintàctica hauria de considerar aquests casos de manera especial.
es_es: Un sistema real de transferencia sintáctica tendría que considerar estos casos de manera especial.

source: Un traductor automàtic per transferència morfològica avançada resol la polisèmia mitjançant l'ús d'un analitzador morfològic.
es_es: Un traductor automático por transferencia morfológica avanzada resuelve la polisemia mediante el uso de un analizador morfológico.

source: Una característica important d'interlingua és que els determinants (un, le, alcun, iste, mi, tu, etc.) i els adjectius són invariables.
es_es: Una característica importante de interlingua es que los determinantes (un, le, alcun, iste, mi, tu, etc.) y los adjetivos son invariables.

source: Una característica important dels primers 1990 és l'aparició de les primeres aplicacions pràctiques per a traductors: eines de suport a la traducció, diccionaris i bases de dades terminològiques, processadors de text multilingües, accés a glossaris i terminologies electròniques, eines de comunicació (escàners, OCRs, Internet; vegeu els capítols i ) o eines per a entorns restringits.
es_es: Una característica importante de inicios de los 90 es la aparición de las primeras aplicaciones prácticas para traductores: herramientas de apoyo a la traducción, diccionarios y bases de datos terminológicas, procesadores de texto multilingües, acceso a glosarios y terminologías electrónicas, herramientas de comunicación (escáneres, OCRs, Internet; véase los capítulos y ) o herramientas para entornos restringidos.

source: Una de les aplicacions més importants de la informàtica a la traducció és la traducció automàtica (TA).
es_es: Una de las aplicaciones más importantes de la informática en la traducción es la traducción automática (TA).

source: Una de les aproximacions més simples a la TA és l'anomenada traducció mot per mot, en què el programa identifica cada mot, el busca en un diccionari bilingüe i el substitueix per una traducció aproximada (vegeu també la pàg. .
es_es: Una de las aproximaciones más simples a la TA es la llamada traducción de palabra por palabra, en la que el programa identifica cada palabra, la busca en un diccionario bilingüe y la sustituye por una traducción aproximada (véase también la pág..

source: Una de les primeres aplicacions de la traducció automàtica als EUA va ser l'anomenat screening o exploració de documents per a decidir quins eren rellevants i mereixien una atenció més detallada: es volia tenir accés a la informació tecnològica present en documents de la Unió Soviètica.
es_es: Una de las primeras aplicaciones de la traducción automática en los EE.UU. fue llamada screening o exploración de documentos para decidir cuáles eran relevantes y merecían una atención más detallada: se quería tener acceso a la información tecnológica presente en documentos de la Unión Soviética.

source: Una formalització possible de la traducció automàtica directa més senzilla possible és la traducció mot a mot: el sistema llig el text original mot a mot d'esquerra a dreta, substitueix cada mot original per un equivalent fix (d'un mot, de més mots, o fins i tot de zero mots) en LM sense tenir en compte el context i escriu els mots un a un i en el mateix ordre en el text meta.
es_es: Una formalización posible de la traducción automática directa más sencilla posible es la traducción palabra a palabra: el sistema lee el texto original palabra a palabra de izquierda a derecha, sustituye cada palabra original por un equivalente fijo (de una palabra, de más palabras, o incluso de cero palabras) en LM sin tener en cuenta el contexto y escribe las palabras una a una y en el mismo orden en el texto meta.

source: Una inventora monolingüe consulta documents web traduïts a la seua llengua per tal de descobrir si el seu nou invent ha estat patentat abans.
es_es: Una inventora monolingüe consulta documentos web traducidos a su lengua para descubrir si su nuevo invento ha sido patentado antes.

source: Una manera d'identificar zones on s'ha d'establir la concordança és detectar seqüències de mots, de manera similar a com es fa en els sistemes de transferència morfològica, però sense reordenar-les.
es_es: Una manera de identificar zonas donde se tiene que establecer la concordancia es detectar secuencias de palabras, de manera similar a cómo se hace en los sistemas de transferencia morfológica, pero sin reordenarlas.

source: Una persona està escrivint un document en llengua origen que després serà traduït automàticament a més d'una llengua meta i el sistema que usa per a escriure l'avisa quan tecleja un mot que donarà problemes de traducció ---i li suggereix alternatives--- o quan escriu una estructura que serà difícil de traduir.
es_es: Una persona está escribiendo un documento en lengua origen que después será traducido automáticamente a más de una lengua meta y el sistema que usa para escribir le avisa cuando teclea una palabra que dará problemas de traducción ---y le sugiere alternativas--- o cuando escribe una estructura que será difícil de traducir.

source: Una possible solució usa frases preposicionals del tipus de del qual postposades a la traducció del sintagma nominal que segueix a cuyo.
es_es: Una posible solución usa frases preposicionales del tipo de del cual postpuestas a la traducción del sintagma nominal que sigue a cuyo.

source: Una traducció idiomàtica possible és: { Després de dinar Koldo va anar al diari i va prendre una foto de Teo.
es_es: Una traducción idiomática posible es: { Després de dinar Koldo va anar al diari i va prendre una foto de Teo.

source: Una traducció més idiomàtica podria ser: { Fa molt temps, en una certa illa, vivia un gran porc i se solia menjar la gent.
es_es: Una traducción más idiomática podría ser: { Fa molt temps, en una certa illa, vivia un gran porc i se solia menjar la gent.

source: Una tècnica observada en alguns programes és la següent: (a) els reordenaments es van aplicant segons es recorre la frase d'esquerra a dreta; (b) els reordenaments de seqüències més llargues tenen prioritat, i (c) els mots afectats per un reordenament no tornen a estar involucrats en cap altre reordenament.
es_es: Una técnica observada en algunos programas es la siguiente: (a) los reordenamientos se van aplicando según se recorre la frase de izquierda a derecha; (b) los reordenamientos de secuencias más largas tienen prioridad, y (c) las palabras afectadas por un reordenamiento no vuelven a estar involucrados en ninguno otro reordenamiento.

source: Una vegada feta aquesta aproximació general, la resta d'aproximacions depenen del tipus de sistema de traducció automàtica.
es_es: Una vez hecha esta aproximación general, el resto de aproximaciones dependen del tipo de sistema de traducción automática.

source: Una vegada obtinguts els alineaments entre els mots, podem aprendre models probabilístics que indiquen, per exemple, la probabilitat que la traducció d'un determinat mot en una llengua siga la traducció d'un determinat mot en l'altra (un model de traducció de paraules o diccionari bilingüe probabilístic), o la probabilitat que la traducció d'una seqüència (segment) de mots en una llengua siga la traducció d'una seqüència (segment) de mots en l'altra (un model de traducció de segments).
es_es: Una vez obtenidos los alineamientos entre las palabras, podemos aprender modelos probabilísticos que indican, por ejemplo, la probabilidad de que la traducción de una determinada palabra en una lengua sea la traducción de una determinada palabra en la otra (un modelo de traducción de palabras o diccionario bilingüe probabilístico), o la probabilidad de que la traducción de una secuencia (segmento) de palabras en una lengua sea la traducción de una secuencia (segmento) de palabras en la otra (un modelo de traducción de segmentos).

source: Usant un algorisme estàndard que no ve al cas detallar ací, la gramàtica es transforma en la taula d'anàlisi sintàctica corresponent:
es_es: Usando un algoritmo estándar que no viene al caso detallar aquí, la gramática se transforma en la tabla de análisis sintáctico correspondiente:

source: Utilitat de la traducció automàtica
es_es: Utilidad de la traducción automática

source: Va apuntar els noms dels boxadors.} Fixeu-vos que fins i tot en aquest cas tan desfavorable el text traduït mot per mot dóna bastantes pistes sobre el significat del text original.
es_es: Va apuntar els noms dels boxadors.} Fijaos que incluso en este caso tan desfavorable el texto traducido palabra por palabra da bastantes pistas sobre el significado del texto original.

source: Vegem com es faria l'anàlisi de l'oració (no ambigua) L'home porta la clau.
es_es: Veamos cómo se haría el análisis de la oración (no ambigua) L'home porta la clau.

source: Vegem que passa amb cada una de les oracions: { Nos ofreció un postre} $$ { Ens va oferir unes postres}: La traducció és correcta.
es_es: Veamos qué pasa con cada una de las oraciones: { Nos ofreció un postre} $$ { Ens va oferir unes postres}: La traducción es correcta.

source: Vegeu l'apartat , on es discuteix un concepte molt relacionat, el de llenguatge controlat.
es_es: Veáse el apartado , donde se discute un concepto muy relacionado, el de lenguaje controlado.

source: Veurem més endavant de quina naturalesa són aquestes representacions intermèdies.
es_es: Más adelante veremos de qué naturaleza son estas representaciones intermedias.

source: Volem posteditar un text traduït automàticament mirant tan poc com siga possible el text original.
es_es: Queremos posteditar un texto traducido automáticamente mirando tan poco como sea posible el texto original.

source: [0.2cm] {{9cm}{ Transferència estructural
es_es: [0.2cm] {{9cm}{ Transferencia estructural

source: [Primera iteració: El alineament entre yn i gur guanya força.]{}
es_es: [Primera iteración: El alineamiento entre yn y gur gana fuerza.]{}

source: [Segona iteració: El alineament entre pifo i ubhfo guanya força.]{}
es_es: [Segunda iteración: El alineamiento entre pifo y ubhfo gana fuerza.]{}

source: [Tercera i última iteració: L'estructura d'alineament que estava ``oculta'' queda al descobert.]{} {Exemple que il·lustra el procés iteratiu que permet obtenir l'alineament entre les paraules de les oracions d'un corpus paral·lel.
es_es: [Tercera y última iteración: La estructura de alineamiento que estaba ``oculta'' queda al descubierto.]{} {Ejemplo que ilustra el proceso iterativo que permite obtener el alineamiento entre las palabras de las oraciones de un corpus paralelo.
